## to install...
## $ brew bundle

# brews
brew 'asdf'                       # language version manager (one to rule them all)
brew 'bat'                        # cat alternative (rust)
brew 'direnv'                     # manage per-directory environment variables
brew 'fd'                         # fast alternative to find
brew 'fzf'                        # command-line fuzzy finder
brew 'github/gh/gh'
brew 'glow'                       # markdown reader
brew 'gnupg'                      # GNU (Pretty Good Privacy)
brew 'htop'                       # improved top (interactive process viewer)
brew 'hugo'                       # improved top (interactive process viewer)
brew 'jq'                         # command-line JSON processor
brew 'koekeishiya/formulae/skhd'  # hotkey daemon for macOS
brew 'koekeishiya/formulae/yabai' # tiling window manager
brew 'neofetch'                   # command-line system info tool
brew 'newsboat'                   # RSS/Atom feed reader for text terminals
brew 'nvim'                       # Neovim brew rgripgrep                # Rust implementation of grep (faster than Ag aka the Silver Searcher)
brew 'ripgrep'                    # Rust implementation of grep (faster than Ag aka the Silver Searcher)
brew 'tmux'                       # terminal multiplexer
brew 'tree'                       # display directories as trees
brew 'universal-ctags/universal-ctags/universal-ctags'
brew 'wget'                       # Internet file retriever
brew 'wtfutil'                    # The personal information dashboard for your terminal
brew 'zoxide'                     # faster way to navigate the filesystem (stack-based)

# casks
cask '1password'
cask 'alacritty'
cask 'alfred'
cask 'authy'
cask 'discord'
cask 'docker'
cask 'fantastical'
cask 'ngrok'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'

# casks (fonts)
cask 'homebrew/cask-fonts/font-meslo-for-powerline'
